Returns the name of the parent of the linked model, or an empty FilePath if the link is a top-level link.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public ModelPath GetParentModelName()
  Visual Basic
Public Function GetParentModelName As ModelPath
  Visual C++
public:
ModelPath^ GetParentModelName()
 See Also
  RevitLinkLoadResult Class
  Autodesk.Revit.DB Namespace